app/views/contacts/edit.html.erb

SELECT "companies".* FROM "companies"
---
    <%= f.label :company %>
    <%= f.collection_select :company_id, Company.all, :id, :name %>