app/views/contacts/new.html.erb

    <%= f.label :company %>
    <%= f.collection_select :company_id, Company.all, :id, :name %>
---
SELECT "companies".* FROM "companies"