app/controllers/companies_controller.rb

  def create
    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("name", "about", "city", "state", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def set_company
      @company = Company.find_by_id(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]