app/controllers/contacts_controller.rb

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def detail
    contact = Contact.find_by_id(params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @contact = Contact.find_by_id(params[:id])

INSERT INTO "contacts" ("username", "email", "password", "company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "kramer"], ["email", "k@kk.com"], ["password", "asdf"], ["company_id", 3], ["created_at", 2017-04-21 21:36:02 UTC], ["updated_at", 2017-04-21 21:36:02 UTC]]
---
  def create
    @contact = Contact.new(contact_params)
    if @contact.save

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @contact = Contact.find_by_id(params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "contacts" SET "image" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["image", "brad.png"], ["updated_at", 2017-04-22 17:40:05 UTC], ["id", 11]]
---
  def update
    @contact = Contact.find_by_id(params[:id])
    @contact.update(contact_params)