app/controllers/pdfs_controller.rb

SELECT  "pdfs".* FROM "pdfs" WHERE "pdfs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def download_pdf
    @pdf = Pdf.find_by_id(params[:id])

INSERT INTO "pdfs" ("location", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["location", "app/assets/pdfs/"], ["created_at", 2017-04-22 00:28:13 UTC], ["updated_at", 2017-04-22 00:28:13 UTC]]
SELECT  "pdfs".* FROM "pdfs" WHERE "pdfs"."name" IS NULL AND "pdfs"."location" = $1 LIMIT $2  [["location", "app/assets/pdfs/"], ["LIMIT", 1]]
---
  def distill_pdf
    @pdf = Pdf.find_or_create_by(name: params[:name], location: 'app/assets/pdfs/')

SELECT "pdfs".* FROM "pdfs"
---
  def index
    @pdfs = Pdf.all

SELECT  "pdfs".* FROM "pdfs" WHERE "pdfs"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @pdf = Pdf.find_by_id(params[:id])

INSERT INTO "pdfs" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "spc-work-orders"], ["location", "#<ActionDispatch::Http::UploadedFile:0x007fd2d2beb930>"], ["created_at", 2017-04-22 00:34:32 UTC], ["updated_at", 2017-04-22 00:34:32 UTC]]
---
  def create
    @pdf = Pdf.create(pdf_params)