app/controllers/tools_controller.rb

SELECT  "pdfs".* FROM "pdfs" WHERE "pdfs"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def show_pdf
    @pdf = Pdf.find(params[:id])